---
title: HermiteSplineTangents
classe: Autodesk.Revit.DB.HermiteSplineTangents
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# HermiteSplineTangents

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ EndTangent { get; set; }` | `hermiteSplineTangents.EndTangent` | XYZ |
| `Boolean IsValidObject { get; }` | `hermiteSplineTangents.IsValidObject` | Boolean |
| `XYZ StartTangent { get; set; }` | `hermiteSplineTangents.StartTangent` | XYZ |
| `Void Dispose()` | `hermiteSplineTangents.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```